In [2]:
import pandas as pd

In [4]:
s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
data = {
    "Nom": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Score": [85, 90, 95]
}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

       Nom  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95

In [8]:
df_students = pd.read_csv("students.csv")

In [12]:
df_students.head() # pour les 5 dernières valeurs tail()

   id    prenom     nom                       email  age groupe   note
0   1     Lucie   Marie     lucie.marie@exemple.com   19      A  16.90
1   2     André  Traore    andré.traore@exemple.com   21      A   9.67
2   3    Robert  Moulin   robert.moulin@exemple.com   19      C  16.89
3   4   Maurice    Joly    maurice.joly@exemple.com   19      C  13.06
4   5  Nathalie   Henry  nathalie.henry@exemple.com   18      A  10.62

In [14]:
# df_students["nom"]

In [15]:
# affichez la deuxième ligne du DataFrame